Documents/удалить_ИА_НастройкаФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>удалить_ИА_НастройкаФП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникХранилищеЗапросаКонстурктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределенияПервичная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыраженияЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиЗначенийПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхВидыДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхВидыДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычисляемоеВыражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвиженияДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/удалить_ИА_НастройкаФП/Forms/КонструкторВидДоходаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаОК(Команда)
    Если РежимКонструктора = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ДвиженияДС") Тогда
        Если НЕ ЗначениеЗаполнено(ИмяРегистраБезнал)
            ИЛИ НЕ ЗначениеЗаполнено(РесурсРегистраБезнал)
            Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Не заполнены обязательные поля!";
            Сообщение.Сообщить(); 
        	Возврат
        КонецЕсли; 
        
		Стр = Новый Структура();
		
		Стр.Вставить("ПредставлениеРегистраБезнал" , ПредставлениеРегистраБезнал);
		Стр.Вставить("ИмяРегистраБезнал",            ИмяРегистраБезнал);
        Стр.Вставить("РесурсРегистраБезнал",         РесурсРегистраБезнал);
        Стр.Вставить("ПараметрыЗапросаБезнал",       ПараметрыДвиженияДСБезнал);
		Стр.Вставить("ПолеСтатьяДДСБезнал",          ПолеСтатьяДДСБезнал);

		Стр.Вставить("ПредставлениеРегистраНал" ,    ПредставлениеРегистраНал);
		Стр.Вставить("ИмяРегистраНал",               ИмяРегистраНал);
        Стр.Вставить("РесурсРегистраНал",            РесурсРегистраНал);
        Стр.Вставить("ПараметрыЗапросаНал",          ПараметрыДвиженияДСНал);
		Стр.Вставить("ПолеСтатьяДДСНал",          	 ПолеСтатьяДДСНал);
		
		Закрыть(Стр);
	Иначе
		Стр = Новый Структура();
		Стр.Вставить("ТекстЗапросаБезнал",      ТекстЗапросаБезнал);
		Стр.Вставить("ПараметрыЗапросаБезнал",  ПараметрыЗапросаБезнал);
		
		Стр.Вставить("ТекстЗапросаНал",         ТекстЗапросаНал);
		Стр.Вставить("ПараметрыЗапросаНал",     ПараметрыЗапросаНал);

		Закрыть(Стр);
	КонецЕсли;
КонецПроцедуры

&НаСервере
//Наполнение дерева списком регистров из метаданных
Процедура ЗаполнитьДеревоРегистров()

	дерРег = РеквизитФормыВЗначение("ДеревоРегистров");
	
	НоваяСтрокаКорень = дерРег.Строки.Добавить();
	////НоваяСтрокаКорень.ПредставлениеРегистра = "Разделы управленческого учета";
    НоваяСтрокаКорень.ПредставлениеРегистра = "Регистры накопления";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыНакопления Цикл

		Если МетаданныеРегистр.Ресурсы.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.ПредставлениеРегистра=МетаданныеРегистр.Представление();
		Регистр.ИмяРегистра = "РегистрНакопления."+МетаданныеРегистр.Имя;
		
	КонецЦикла;
	
	НоваяСтрокаКорень = дерРег.Строки.Добавить();
	////НоваяСтрокаКорень.ПредставлениеРегистра = "Разделы бухгалтерского и налогового учета";
    НоваяСтрокаКорень.ПредставлениеРегистра = "Регистры бухгалтерии";

	Для Каждого МетаданныеРегистр Из Метаданные.РегистрыБухгалтерии Цикл

        Если МетаданныеРегистр.Ресурсы.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;

		Регистр = НоваяСтрокаКорень.Строки.Добавить();
		Регистр.ПредставлениеРегистра = МетаданныеРегистр.Представление();
		Регистр.ИмяРегистра = "РегистрБухгалтерии."+МетаданныеРегистр.Имя;
	КонецЦикла;

	ЗначениеВРеквизитФормы(дерРег, "ДеревоРегистров");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДеревоРегистров();
	
	ПараметрыСтруктура = Новый Структура;
	
	ПараметрыСтруктура.Вставить("ИмяРегистраБезнал", Параметры.ИмяРегистраБезнал);
	ПараметрыСтруктура.Вставить("ПредставлениеРегистраБезнал", Параметры.ПредставлениеРегистраБезнал);
	ПараметрыСтруктура.Вставить("ИмяРегистраНал", Параметры.ИмяРегистраНал);
	ПараметрыСтруктура.Вставить("ПредставлениеРегистраНал", Параметры.ПредставлениеРегистраНал);
	ПараметрыСтруктура.Вставить("РесурсРегистраБезнал", Параметры.РесурсРегистраБезнал);
	ПараметрыСтруктура.Вставить("ПолеСтатьяДДСБезнал", Параметры.ПолеСтатьяДДСБезнал);
	ПараметрыСтруктура.Вставить("РесурсРегистраНал", Параметры.РесурсРегистраНал);
	ПараметрыСтруктура.Вставить("ПолеСтатьяДДСНал", Параметры.ПолеСтатьяДДСНал);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРегистровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяГруппы  = Элемент.Родитель.Имя;
	
	ПостФикс = ОпределитьПостфикс();
	ПостфиксСписка = ОпределитьПостфиксСписка();
	//ПостФиксСписка - Специальный постфикс, добавлен специально для элемента формы "РесурсРегистра" т.к. к списку идет обращение только через "Элементы"
	
	Если ИмяГруппы = "ГруппаВыражениеНаличные" Тогда		
		ТекущаяСтрока = Элементы.ДеревоРегистровНаличные.ТекущиеДанные; 
	ИначеЕсли ИмяГруппы = "ГруппаВыражениеБезналичные" Тогда 
		ТекущаяСтрока = Элементы.ДеревоРегистровБезналичные.ТекущиеДанные;
	Иначе
		ТекущаяСтрока = Элементы.ДеревоРегистров.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	     
	
	Если НЕ ТекущаяСтрока.ИмяРегистра = "" Тогда
		ЭтаФорма["ПредставлениеРегистра"+ПостФикс] = ТекущаяСтрока.ПредставлениеРегистра;
		ЭтаФорма["ИмяРегистра"+ПостФикс]           = ТекущаяСтрока.ИмяРегистра;
	КонецЕсли;
	
	Элементы["РесурсРегистра"+ПостФиксСписка].СписокВыбора.Очистить();
	Элементы["ПолеСтатьяДДС"+ПостФиксСписка].СписокВыбора.Очистить();
	ЗаполнитьТаблицуОтбораРегистра(ПостФикс,ПостФиксСписка);
    ЭтаФорма["РесурсРегистра"+ ПостФикс] = "";
	ЭтаФорма["ПолеСтатьяДДС"+ ПостФикс] = "";
	
	
	Постфикс = ОпределитьПостфикс();
	
	Элементы.ТаблицаПараметровДвижениеДСБезналичныеПараметр.СписокВыбора.Очистить();
	СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма["ИмяРегистра"+ПостФикс]);  
	Для каждого ТекПараметрСтруктуры Из СтруктураПараметров Цикл
	  Элементы.ТаблицаПараметровДвижениеДСБезналичныеПараметр.СписокВыбора.Добавить(ТекПараметрСтруктуры.Значение);
    КонецЦикла; 
	
	Если ПостфиксСписка = "" Тогда
		ИмяЭлементаПоле = "ТаблицаПараметровДвижениеДСПараметр"
	Иначе
		ИмяЭлементаПоле = "ТаблицаПараметровДвижениеДС"+ПостфиксСписка+"ичныеПараметр"
	КонецЕсли;
	
	ЗаполнитьСписокВыбораЭлементаПоле("ИмяРегистра"+ПостФикс, ИмяЭлементаПоле);
	
	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элементы["ПолеСтатьяДДС"+ПостфиксСписка], Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораЭлементаПоле(ИмяРегистра, ИмяЭлемента)
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРегистра]) Тогда
		
		ЭлементПоле  = Элементы[ИмяЭлемента];
		СписокВыбора = ЭлементПоле.СписокВыбора;
		СписокВыбора.Очистить();
		
		СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма[ИмяРегистра]);  
		
		Для каждого ТекПараметрСтруктуры Из СтруктураПараметров Цикл
			СписокВыбора.Добавить(ТекПараметрСтруктуры.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры           

&НаКлиенте
Процедура ЗаполнитьТаблицуОтбораРегистра(ПостФикс = "Безнал",ПостФиксСписка)
    
   Перем НоваяСтрока, СтруктураПараметров, ТекПараметр;
	
   ТаблицаПараметровДвиженияДС = ЭтаФорма["ПараметрыДвиженияДС"+ПостФикс];
   ТаблицаПараметровДвиженияДС.Очистить(); 
   
   Если ЗначениеЗаполнено(ЭтаФорма["ИмяРегистра"+ПостФикс]) Тогда
		
		Если НЕ ЭтаФорма["ПредставлениеРегистра"+ПостФикс] = Неопределено И
    		 НЕ ЭтаФорма["ИмяРегистра"+ПостФикс] = "" Тогда
            Элементы["РесурсРегистра"+ПостФиксСписка].СписокВыбора.ЗагрузитьЗначения(ИА_ФП.ПолучитьСписокРеквизитов(ЭтаФорма["ИмяРегистра"+ПостФикс], "Ресурсы"));
    	КонецЕсли;
    	
        СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма["ИмяРегистра"+ПостФикс]);
        
       
        Для ТекПараметр = 1 По СтруктураПараметров.Количество() Цикл
            НоваяСтрока = ТаблицаПараметровДвиженияДС.Добавить();
            НоваяСтрока.Параметр	 = СтруктураПараметров["Измерение" + ТекПараметр];
            НоваяСтрока.ТипСравнения = ВидСравнения.Равно;	
		КонецЦикла;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтбор(Команда)
	
	Постфикс = ОпределитьПостфикс();
	ПостфиксСписка = ОпределитьПостфиксСписка();
	
	Если ЭтаФорма["ПараметрыДвиженияДС"+Постфикс].Количество() = 0 ИЛИ 
		 Вопрос("Заполнить таблицу отбора ?",РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
		     		ЗаполнитьТаблицуОтбораРегистра(Постфикс,ПостфиксСписка);
	КонецЕсли; 
	
КонецПроцедуры

//&НаКлиенте
//Процедура РесурсНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	
//	ЗаполнитьСписокВыбораРесурсРегистраБезнал(Элемент, СтандартнаяОбработка);
//КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыПоВыбранномуРегистру(ИмяРегистра)
    
    ЭтоРБ = Лев(ИмяРегистра, 18) = "РегистрБухгалтерии";
	СтруктураИзмерений = Новый Структура;
	МетаданныеРегистр = Метаданные.НайтиПоПолномуИмени(ИмяРегистра);
	Ключ = 0;
	Для Каждого ИзмерениеРегистра Из МетаданныеРегистр.Измерения Цикл
		Ключ = Ключ + 1;
        Если ЭтоРБ и НЕ ИзмерениеРегистра.Балансовый Тогда
            СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ИзмерениеРегистра.Имя + "Дт");
            Ключ = Ключ + 1;
            СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ИзмерениеРегистра.Имя + "Кт");
        Иначе
            СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ИзмерениеРегистра.Имя);
        КонецЕсли; 		
	КонецЦикла;
	
	Если ЭтоРБ Тогда
		Ключ = Ключ + 1;
		СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), "СчетДт");
        Ключ = Ключ + 1;
        СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), "СчетКт");
		//Ключ = Ключ + 1;
		//СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), "ВидДвижения");
		
		Для Каждого ТекРеквизит ИЗ МетаданныеРегистр.СтандартныеРеквизиты Цикл
			Если Лев(ТекРеквизит.Имя, 8) = "Субконто" Тогда
				Ключ = Ключ + 1;
				СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ТекРеквизит.Имя + "Дт");
			КонецЕсли;
		КонецЦикла;
        
   		Для Каждого ТекРеквизит ИЗ МетаданныеРегистр.СтандартныеРеквизиты Цикл
			Если Лев(ТекРеквизит.Имя, 8) = "Субконто" Тогда
				Ключ = Ключ + 1;
				СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ТекРеквизит.Имя + "Кт");
			КонецЕсли;
		КонецЦикла;

    Иначе
		Если МетаданныеРегистр.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			//Ключ = Ключ + 1;
			//СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), "ВидДвижения");
			Для Каждого ТекРеквизит ИЗ МетаданныеРегистр.Реквизиты Цикл
				Ключ = Ключ + 1;
				СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ТекРеквизит.Имя);
			КонецЦикла;
			Для Каждого ТекРеквизит ИЗ МетаданныеРегистр.СтандартныеРеквизиты Цикл
				Ключ = Ключ + 1;
				СтруктураИзмерений.Вставить("Измерение" + Строка(Ключ), ТекРеквизит.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураИзмерений;
	
КонецФункции

&НаСервере
Функция ПолучитьТипРеквизита(имяРегистра, имяРеквизита)
    ЭтоРБ = Найти(имяРегистра, "РегистрБухгалтерии.")=1;
	регистр = ИА_ФП.ПолучитьРегистрПоИмени(имяРегистра);
	Если Найти("/Счет/СчетДт/СчетКт/", имяРеквизита) > 0 Тогда
		реквТип = регистр.ПланСчетов.СтандартныеРеквизиты.Ссылка.Тип;
	Иначе	
		Попытка
            Если имяРеквизита = "ВидДвижения" Тогда
                РеквТип = Новый ОписаниеТипов("ВидДвиженияНакопления");
            Иначе
                Если ИА_БФКС.РеквизитЕсть(регистр.Измерения, имяРеквизита) Тогда
                    рекв = регистр.Измерения[имяРеквизита];
				ИначеЕсли ИА_БФКС.РеквизитЕсть(регистр.Реквизиты, имяРеквизита) Тогда
                    рекв = регистр.Реквизиты[имяРеквизита];
				ИначеЕсли ИА_БФКС.РеквизитЕсть(регистр.СтандартныеРеквизиты, имяРеквизита) Тогда
                    рекв = регистр.СтандартныеРеквизиты[имяРеквизита];
                Иначе
                    ИмяБезСуффикса = Лев(имяРеквизита, СтрДлина(имяРеквизита)-2);
                    рекв = регистр.Измерения[ИмяБезСуффикса];
                КонецЕсли; 
			    РеквТип = Рекв.Тип;
            КонецЕсли;             
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат РеквТип;
КонецФункции

&НаКлиенте
Процедура ТаблицаПараметровДвижениеДСЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы[Элемент.Родитель.Имя].ТекущиеДанные;
	
    Если Лев(ТекДанные.Параметр, 8) = "Субконто" Тогда
        Суффикс = Прав(ТекДанные.Параметр, 2);
        М = ПараметрыДвиженияДСБезнал.НайтиСтроки(Новый Структура("Параметр", "Счет" + Суффикс));
        Если М.Количество() > 0 Тогда
        	Счет = М[0].Значение;
        Иначе
            Счет = Неопределено;
		КонецЕсли;
		
        НомерСубконто = Число(Сред(ТекДанные.Параметр, 9, 1));        
        ТипРеквизита = ПолучитьТипСубконтоПоСчету(Счет, ИмяРегистраБезнал, НомерСубконто);
        Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипРеквизита);        
        
    Иначе		
		ТипРеквизита = ПолучитьТипРеквизита(ИмяРегистраБезнал, ТекДанные.Параметр);
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипРеквизита);
	КонецЕсли;
	
	//Особенность с подчиненными справочниками которые просто так открыть нельзя
	Если ЕстьБС() Тогда 
		СодержитБС = ТипРеквизита.СодержитТип(Тип("СправочникСсылка.БанковскиеСчета"));
	Иначе
		СодержитБС = Ложь;
	КонецЕсли;
	Если СодержитБС Тогда
		СтандартнаяОбработка = Ложь;
		СписокЗн = Новый СписокЗначений;
		Типы = ТипРеквизита.Типы();
		Для Каждого Эл Из Типы Цикл
			СписокЗн.Добавить(Эл,""+Эл);
		КонецЦикла;
		Выб = СписокЗн.ВыбратьЭлемент("Выбор типа данных");
		
		Если Выб = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ТипРеквизита = Выб.Значение;
		Если ТипРеквизита = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Попытка
				//обычное приложение
				Если ТекДанные.ТипСравнения = ВидСравнения.ВСписке ИЛИ ТекДанные.ТипСравнения = ВидСравнения.НеВСписке Тогда
					СтандартнаяОбработка = ложь;
					
					СЗ = Новый СписокЗначений;
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипРеквизита); 
					СЗ.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
					
					П = Новый Структура();
					П.Вставить("ОписаниеТипа", СЗ.ТипЗначения);
					П.Вставить("СписокЗначений", ТекущийЭлемент.ТекущиеДанные.Значение);
					ф = ОткрытьФорму("Документ.удалить_ИА_НастройкаФП.Форма.ФормаВводаСпискаЗначений",П,ЭтаФорма);
					Возврат;
				Иначе
					СтандартнаяОбработка = ложь;
					ф = ПолучитьФорму("Справочник.БанковскиеСчета.ФормаВыбора");
					ф.Отбор.Владелец.Значение = ВернутьЛюбогоКонтрагента();
					ф.Отбор.Владелец.Использование = Ложь;
					рез = ф.ОткрытьМодально();
					Если Рез <> Неопределено Тогда 
						ТекущийЭлемент.ТекущиеДанные.Значение = рез;
					КонецЕсли;
					Возврат;
				КонецЕсли;
				
			Исключение
				//управляемое приложение
				СтандартнаяОбработка = Истина;
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипРеквизита); 
				Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
			КонецПопытки;
		Иначе
			СтандартнаяОбработка = Истина;
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипРеквизита); 
			Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		КонецЕсли;
	КонецЕсли;
	//
	
	Если ТекДанные.ТипСравнения = ВидСравнения.ВСписке ИЛИ ТекДанные.ТипСравнения = ВидСравнения.НеВСписке Тогда
		
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
				
		СЗ = Новый СписокЗначений;
		Если Лев(ТекДанные.Параметр, 8) = "Субконто" Тогда 
			СЗ.ТипЗначения = Новый ОписаниеТипов();
		Иначе
			Попытка
				//Обычное приложение
				СЗ.ТипЗначения = ТипРеквизита;
			Исключение
				//Упр. приложение
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипРеквизита); 
				СЗ.ТипЗначения = Новый ОписаниеТипов(МассивТипов);;
			КонецПопытки;
			
		КонецЕсли;
		Если ТипЗнч(ТекДанные.Значение) = Тип("СписокЗначений") Тогда
			Для каждого Эл Из ТекДанные.Значение Цикл
				СЗ.Добавить(Эл.Значение);
			КонецЦикла; 
		КонецЕсли;
		
		ТекДанные.Значение = СЗ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьБС()
	Возврат Метаданные.Справочники.Найти("БанковскиеСчета") <> Неопределено;
КонецФункции

&НаСервереБезконтекста
Функция ВернутьЛюбогоКонтрагента()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПараметровДвижениеДСЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаПараметровДвижениеДС.ТекущиеДанные;
	Элемент.СписокВыбора.Очистить();
	Если ТекДанные.Параметр = "Вид движения" Тогда
		Элемент.КнопкаОткрытия = Ложь;
		Если Лев(ИмяРегистраБезнал, 18) = "РегистрБухгалтерии" Тогда
			Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.СписокВыбора.Вставить(0,"Дебет");
			Элемент.СписокВыбора.Вставить(1,"Кредит");
		Иначе
			Элемент.КнопкаОткрытия = Ложь;
			Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.СписокВыбора.Вставить(0,"Приход");
			Элемент.СписокВыбора.Вставить(1,"Расход");		
		КонецЕсли;
	Иначе	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровДвижениеДСЗначениеПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипСубконтоПоСчету(Счет, ИмяРегистра, ИндексСубконто)
	регистр = ИА_ФП.ПолучитьРегистрПоИмени(имяРегистра);
	ПланСчетов = регистр.ПланСчетов;
	НужныйСчет = ПланыСчетов[ПланСчетов.Имя].НайтиПоКоду(Счет);
	СписокСубконто = Новый СписокЗначений;
	Для Каждого ТекСубконто Из НужныйСчет.ВидыСубконто Цикл
		СписокСубконто.Добавить(ТекСубконто.ВидСубконто);		
	КонецЦикла;
	Попытка 
		ТипСубконто = СписокСубконто.Получить(ИндексСубконто-1).Значение.ТипЗначения;
	Исключение
		//ТипСубконто = "Строка";
		ТипСубконто = Неопределено;
	КонецПопытки;
	Возврат ТипСубконто;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриСозданииНаСервереФрагмент();
    УправлениеЭлементамиФормы();
	
	ЗаполнитьСписокВыбораЭлементаПоле("ИмяРегистраБезнал", "ТаблицаПараметровДвижениеДСБезналичныеПараметр");
	ЗаполнитьСписокВыбораЭлементаПоле("ИмяРегистраНал",    "ТаблицаПараметровДвижениеДСНаличныеПараметр");
	ЗаполнитьСписокВыбораЭлементаПоле("ИмяРегистраБезнал", "ТаблицаПараметровДвижениеДСПараметр");

	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элементы.ПолеСтатьяДДС, Ложь);
	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элементы.ПолеСтатьяДДСБезнал, Ложь);
	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элементы.ПолеСтатьяДДСНал, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросаБезнал(Команда)
   ОткрытьКонструкторЗапроса(ТекстЗапросаБезнал);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(ВыбранныйТекстЗапроса)
    
    #Если НЕ (ВебКлиент  ИЛИ ТонкийКлиент)  Тогда
        
        
        Если ЗначениеЗаполнено(ВыбранныйТекстЗапроса) Тогда
            Конструктор = Новый КонструкторЗапроса(ВыбранныйТекстЗапроса);
        Иначе
            Конструктор = Новый КонструкторЗапроса();                 
        КонецЕсли;
        
        Если Конструктор.ОткрытьМодально() Тогда
            ВыбранныйТекстЗапроса = Конструктор.Текст;
        Иначе
            Модифицированность = Ложь;
        КонецЕсли;
        
    #КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()

	#Если ТонкийКлиент ИЛИ ВебКлиент Тогда
	  Элементы.ОткрытьКонструкторЗапросаБезнал.Видимость = Ложь; 
	  Элементы.ОткрытьКонструкторЗапроса.Видимость = Ложь; 
	  Элементы.ОткрытьКонструкторЗапросаНал.Видимость = Ложь;
    #КонецЕсли
	
	Элементы.ГруппаВыражения.Видимость         = РежимКонструктора = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.ДвиженияДС");
	Элементы.ГруппаЗапросы.Видимость           = РежимКонструктора = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхВидыДоходов.Запрос");
	
	Элементы.ГруппаЗапросБезналичные.Видимость = РазделятьНалБезнал;
	Элементы.ГруппаЗапросНаличные.Видимость    = РазделятьНалБезнал;
	Элементы.ГруппаЗапрос.Видимость            = НЕ РазделятьНалБезнал;
	
	Элементы.ГруппаВыражениеБезналичные.Видимость = РазделятьНалБезнал;
	Элементы.ГруппаВыражениеНаличные.Видимость    = РазделятьНалБезнал;
	Элементы.ГруппаВыражение.Видимость            = НЕ РазделятьНалБезнал;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыЗапросаНаСервере(ПостФикс)
	
	СтруктураПараметров = Новый Структура();
	ТекущийТекстЗапроса = ЭтаФорма["ТекстЗапроса"+ПостФикс];
	
	Если  НЕ (ТекущийТекстЗапроса) = "" Тогда
		Запрос = Новый Запрос(ТекущийТекстЗапроса);
		Попытка
			НайденныеПараметры = Запрос.НайтиПараметры();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
		Для каждого ПараметрЗапроса из НайденныеПараметры Цикл
			СтруктураПараметров.Вставить(ПараметрЗапроса.Имя, ПараметрЗапроса.ТипЗначения);
		КонецЦикла;
	КонецЕсли;
	Возврат СтруктураПараметров;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьПараметрыЗапроса(Команда)
	
	Если Вопрос("Список параметров будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СтруктураПараметровЗапроса = ЗаполнитьПараметрыЗапросаНаСервере("Безнал");
		Если ТипЗнч(СтруктураПараметровЗапроса) = Тип("Структура") Тогда
			ПараметрыЗапросаБезнал.Очистить();
			Для каждого ПараметрЗапроса из СтруктураПараметровЗапроса Цикл
				Если Найти(ПараметрЗапроса.Ключ,"ДатаКонца")>0 ИЛИ
					 Найти(ПараметрЗапроса.Ключ,"ДатаНачала")>0 Тогда
					 Продолжить;
				КонецЕсли;	 
				НовыйПараметр = ПараметрыЗапросаБезнал.Добавить();
				НовыйПараметр.Параметр = ПараметрЗапроса.Ключ;
				НовыйПараметр.Значение = ПараметрЗапроса.Значение.ПривестиЗначение(НовыйПараметр.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыЗапросаНал(Команда)
	
	Если Вопрос("Список параметров будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СтруктураПараметровЗапроса = ЗаполнитьПараметрыЗапросаНаСервере("Нал");
		Если ТипЗнч(СтруктураПараметровЗапроса) = Тип("Структура") Тогда
			ПараметрыЗапросаНал.Очистить();
			Для каждого ПараметрЗапроса из СтруктураПараметровЗапроса Цикл
				Если Найти(ПараметрЗапроса.Ключ,"ДатаКонца")>0 ИЛИ
					 Найти(ПараметрЗапроса.Ключ,"ДатаНачала")>0 Тогда
					 Продолжить;
				КонецЕсли;
				НовыйПараметр = ПараметрыЗапросаНал.Добавить();
				НовыйПараметр.Параметр = ПараметрЗапроса.Ключ;
				НовыйПараметр.Значение = ПараметрЗапроса.Значение.ПривестиЗначение(НовыйПараметр.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Функция ОпределитьПостфикс()

   	Постфикс = "Безнал";
	
	Если Найти(ЭтаФорма.ТекущийЭлемент.Имя,"Безнал")=0 И
		 РазделятьНалБезнал Тогда
	  	 Постфикс = "Нал";
	КонецЕсли;
	
    Возврат	Постфикс;

КонецФункции // ОпределитьПостфикс()

&НаСервере
Функция ОпределитьПостфиксСписка()
	
	ПостфиксСписка = "Безнал";
	
	Если Найти(ЭтаФорма.ТекущийЭлемент.Имя,"Безнал")=0 И РазделятьНалБезнал Тогда
	  	 ПостфиксСписка = "Нал";
	ИначеЕсли Найти(ЭтаФорма.ТекущийЭлемент.Имя,"Безнал")=0 И Не РазделятьНалБезнал Тогда
	  	 ПостфиксСписка = "";
	КонецЕсли;
	
    Возврат	ПостфиксСписка;

КонецФункции // ОпределитьПостфиксСписка()



&НаСервере
Процедура ПриСозданииНаСервереФрагмент()
	
	//ПараметрыСтруктура = Параметры;
	
	ИмяРегистраБезнал = ПараметрыСтруктура.ИмяРегистраБезнал;
	ПредставлениеРегистраБезнал = ПараметрыСтруктура.ПредставлениеРегистраБезнал;
	ИмяРегистраНал = ПараметрыСтруктура.ИмяРегистраНал;
	ПредставлениеРегистраНал = ПараметрыСтруктура.ПредставлениеРегистраНал;
	
	ЗаполнитьСписокВыбораВПолях();
	
	РесурсРегистраБезнал = ПараметрыСтруктура.РесурсРегистраБезнал;
	ПолеСтатьяДДСБезнал = ПараметрыСтруктура.ПолеСтатьяДДСБезнал;
	РесурсРегистраНал = ПараметрыСтруктура.РесурсРегистраНал;
	ПолеСтатьяДДСНал = ПараметрыСтруктура.ПолеСтатьяДДСНал;

КонецПроцедуры

&НаКлиенте
Процедура ПолеСтатьяДДСБезналНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
    ИмяГруппы = Элемент.Родитель.Имя;
	Постфикс = ОпределитьПостфикс();
	Если НЕ ПредставлениеРегистраБезНал = Неопределено И
		 НЕ ИмяРегистраБезнал = "" Тогда
		Элемент.СписокВыбора.ЗагрузитьЗначения(ИА_ФП.ПолучитьСписокРеквизитов(ЭтаФорма["ИмяРегистра"+ПостФикс], "Измерения"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РесурсРегистраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораРесурсРегистраБезнал(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораРесурсРегистраБезнал(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
    ИмяГруппы = Элемент.Родитель.Имя;
	
	ПостФикс   = "Безнал";	
	
	Если ИмяГруппы = "ГруппаВыражениеНаличные" Тогда		
		ПостФикс   = "Нал";
	ИначеЕсли ИмяГруппы = "ГруппаВыражениеБезналичные" Тогда 
		ПостФикс   = "Безнал";
	КонецЕсли;
	Если НЕ ПредставлениеРегистраБезНал = Неопределено И
		 НЕ ИмяРегистраБезнал = "" Тогда
		Элемент.СписокВыбора.ЗагрузитьЗначения(ИА_ФП.ПолучитьСписокРеквизитов(ЭтаФорма["ИмяРегистра"+ПостФикс], "Ресурсы"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВПолях()
	ПостФиксРеквизита = "Безнал";
	ПостФиксЭлемента = "";
	ОбработатьСпискиДляПолей("РесурсРегистра",ПостФиксРеквизита,ПостФиксЭлемента,"Ресурсы");
	ОбработатьСпискиДляПолей("ПолеСтатьяДДС",ПостФиксРеквизита,ПостФиксЭлемента,"Измерения");
	
	Если РазделятьНалБезнал Тогда
		ПостФиксРеквизита = "Безнал";
		ПостФиксЭлемента = "Безнал";
		ОбработатьСпискиДляПолей("РесурсРегистра",ПостФиксРеквизита,ПостФиксЭлемента,"Ресурсы");
		ОбработатьСпискиДляПолей("ПолеСтатьяДДС",ПостФиксРеквизита,ПостФиксЭлемента,"Измерения");
		
		ПостФиксРеквизита = "Нал";
		ПостФиксЭлемента = "Нал";
		ОбработатьСпискиДляПолей("РесурсРегистра",ПостФиксРеквизита,ПостФиксЭлемента,"Ресурсы");
		ОбработатьСпискиДляПолей("ПолеСтатьяДДС",ПостФиксРеквизита,ПостФиксЭлемента,"Измерения");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьСпискиДляПолей(ИмяПоля, ПостФиксРеквизита,ПостФиксЭлемента, ВидРеквизита)
	ТекЭлемент = Элементы[ИмяПоля + ПостФиксЭлемента];
	ТекЭлемент.СписокВыбора.Очистить();
	
	ЗначениеПоляРегистр 			= ЭтаФорма["ИмяРегистра" + ПостФиксРеквизита];
	ПредставлениеЗначенияПоляРегистр= ЭтаФорма["ПредставлениеРегистра" + ПостФиксРеквизита];	
	
	Если НЕ ПредставлениеЗначенияПоляРегистр = Неопределено И
		 НЕ ЗначениеПоляРегистр = "" Тогда
		ТекЭлемент.СписокВыбора.ЗагрузитьЗначения(ИА_ФП.ПолучитьСписокРеквизитов(ЗначениеПоляРегистр, ВидРеквизита));
	КонецЕсли;
КонецПроцедуры
//&НаКлиенте
//Процедура ПолеСтатьяДДСБезналНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	ЗаполнитьСписокВыбораПолеСтатьяДДСБезнал(Элемент, СтандартнаяОбработка);
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПараметровДвижениеДСНаличныеПараметрНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	
//	Постфикс = ОпределитьПостфикс();
//	Элемент.СписокВыбора.Очистить();
//	СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма["ИмяРегистра"+ПостФикс]);  
//	Для каждого ТекПараметрСтруктуры Из СтруктураПараметров Цикл
//		Элемент.СписокВыбора.Добавить(ТекПараметрСтруктуры.Значение);
//	КонецЦикла; 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПараметровДвижениеДСПараметрНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	Постфикс = ОпределитьПостфикс();
//	Элемент.СписокВыбора.Очистить();
//	СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма["ИмяРегистра"+ПостФикс]);  
//	Для каждого ТекПараметрСтруктуры Из СтруктураПараметров Цикл
//		Элемент.СписокВыбора.Добавить(ТекПараметрСтруктуры.Значение);
//	КонецЦикла; 
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПараметровДвижениеДСПараметрБезналичныеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

//	Постфикс = ОпределитьПостфикс();
//	Элемент.СписокВыбора.Очистить();
//	СтруктураПараметров = ЗаполнитьПараметрыПоВыбранномуРегистру(ЭтаФорма["ИмяРегистра"+ПостФикс]);  
//	Для каждого ТекПараметрСтруктуры Из СтруктураПараметров Цикл
//	  Элемент.СписокВыбора.Добавить(ТекПараметрСтруктуры.Значение);
//    КонецЦикла; 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПараметровДвижениеДСБезналичныеПриАктивизацииЯчейки(Элемент)
//	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ВернутьЛюбогоКонтрагента());
//	НовыйМассив = Новый Массив();
//	НовыйМассив.Добавить(НовыйПараметр);
//	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
//	Элемент.ПараметрыВыбора = НовыеПараметры;

//КонецПроцедуры

//&НаКлиенте
//Процедура ТаблицаПараметровДвижениеДСПриАктивизацииЯчейки(Элемент)
//	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ВернутьЛюбогоКонтрагента());
//	НовыйМассив = Новый Массив();
//	НовыйМассив.Добавить(НовыйПараметр);	
//	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
//	Элемент.ТекущийЭлемент.ПараметрыВыбора = НовыеПараметры;
//КонецПроцедуры
